README.org
# This is the emacs org-mode original for the README.html file.
* The project
LQN is an implementation of the Liquidity Networks Complementary
currency scheme.  See [[http://theliquiditynetwork.org][the Liquidity Network web site]] for more details.
* How to use LQN
* Developers
We are trying to ensure that we develop to the current agile best
practice including:
- Test driven development
- Inline documentation
- Continuous build
** Coding standards
We try to confirm to [[http://www.python.org/dev/peps/pep-0008/][PEP 8]] for code standards and [[http://www.python.org/dev/peps/pep-0257/][PEP 257]] for
Docstring conventions.
** Virtual environments.
We recommend that developers set up a virtualenv environment to ensure
that we don't clash with system-wide Python packages.
*** Packages we use.
These include:
- coverage-2.85-py2.6
- PasteDeploy-1.3.3-py2.6
- PasteScript-1.7.3-py2.6
- setuptools-0.6c9-py2.6
- nose-0.11.1-py2.6
- Paste-1.7.2-py2.6

