README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-06-04 11:10:50 IST"/>
<meta name="author" content="Stephen Butler"/>
</head><body>
<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 The project </a></li>
<li><a href="#sec-2">2 How to use LQN </a></li>
<li><a href="#sec-3">3 Developers </a>
<ul>
<li><a href="#sec-3.1">3.1 Coding standards </a></li>
<li><a href="#sec-3.2">3.2 Virtual environments. </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 Packages we use. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 The project </h2>
<div id="text-1">

<p>LQN is an implementation of the Liquidity Networks Complementary
currency scheme.  See <a href="http://theliquiditynetwork.org">the Liquidity Network web site</a> for more details.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 How to use LQN </h2>
<div id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Developers </h2>
<div id="text-3">

<p>We are trying to ensure that we develop to the current agile best
practice including:
</p><ul>
<li>
Test driven development
</li>
<li>
Inline documentation
</li>
<li>
Continuous build
</li>
</ul>

</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 Coding standards </h3>
<div id="text-3.1">

<p>We try to confirm to <a href="http://www.python.org/dev/peps/pep-0008/">PEP 8</a> for code standards and <a href="http://www.python.org/dev/peps/pep-0257/">PEP 257</a> for
Docstring conventions.
</p></div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 Virtual environments. </h3>
<div id="text-3.2">

<p>We recommend that developers set up a virtualenv environment to ensure
that we don't clash with system-wide Python packages.
</p>
</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1">3.2.1 Packages we use. </h4>
<div id="text-3.2.1">

<p>These include:
</p><ul>
<li>
coverage-2.85-py2.6
</li>
<li>
PasteDeploy-1.3.3-py2.6
</li>
<li>
PasteScript-1.7.3-py2.6
</li>
<li>
setuptools-0.6c9-py2.6
</li>
<li>
nose-0.11.1-py2.6
</li>
<li>
Paste-1.7.2-py2.6

</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: Stephen Butler
<a href="mailto:stephen@stephen-ibm">&lt;stephen@stephen-ibm&gt;</a>
</p>
<p class="date"> Date: 2009-06-04 11:10:50 IST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
